Revit 2027 API
PrintSetup.SaveAs Method
Save the current print setting to another print setting with the specified name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SaveAs(
	string newName
)
Public Function SaveAs (
	newName As String
) As Boolean
public:
bool SaveAs(
	String^ newName
)
member SaveAs :
        newName : string -> bool
Parameters
newName String
print setting name to be saved as.
Return Value
Boolean
False if Save As operation fails, otherwise true.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the input newName already exists in current print setting list.
See Also
Reference
PrintSetup Class
Autodesk.Revit.DB Namespace